In [138]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

# PassengerId: Unique identifier for each passenger.
# Survived: Survival status of the passenger (0 = Not Survived, 1 = Survived).
# Pclass: Passenger class (1 = First class, 2 = Second class, 3 = Third class).
# Sex: Gender of the passenger.
# Age: Age of the passenger.
# SibSp: Number of siblings/spouses aboard the Titanic.
# Parch: Number of parents/children aboard the Titanic.
# Fare: Fare paid by the passenger.
# Embarked: Port of embarkation (C = Cherbourg, Q = Queenstown, S = Southampton).

In [139]:
x_y_train = pd.read_csv("titanic/train.csv", index_col="PassengerId")
x_y_train.head(2)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [140]:
# x_y_train["Name"].unique()

In [141]:
def drop_columns(df, *columns):
    for col in columns:
        df = df.drop(col, axis=1)
    
    return df

In [142]:
x_y_train["FamilySize"] = x_y_train["SibSp"] + x_y_train["Parch"] + 1
x_y_train

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1

In [143]:
x_y_train["IsAlone"] = (x_y_train["FamilySize"] == 1).astype(int)
x_y_train

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize,IsAlone
PassengerId,,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,0
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,0
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,0
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,1
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,1
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4,0
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,1
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,1

In [144]:
x_y_train["Cabin"].isnull().sum()

np.int64(687)

In [145]:
x_y_train["HasCabin"] = x_y_train["Cabin"].notnull()
x_y_train

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize,IsAlone,HasCabin
PassengerId,,,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,0,False
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,0,True
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1,False
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,0,True
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,1,False
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,1,True
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4,0,False
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,1,True
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,1,False

In [146]:
x_y_train["HasCabin"] = x_y_train["Cabin"].notnull().astype(int)
x_y_train

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize,IsAlone,HasCabin
PassengerId,,,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,0,0
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,0,1
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1,0
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,0,1
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,1,0
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,1,1
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,4,0,0
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,1,1
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,1,0

In [147]:
x_y_train["Embarked"].isnull().sum()

np.int64(2)

# o tactica este de a umple cu valoarea care apare cel mai des / sau media

In [148]:
x_y_train["Embarked"] = x_y_train["Embarked"].fillna('S')
x_y_train["Embarked"].isnull().sum()

np.int64(0)

In [149]:
x_y_train.isnull().sum()

Survived        0
Pclass          0
Name            0
Sex             0
Age           177
SibSp           0
Parch           0
Ticket          0
Fare            0
Cabin         687
Embarked        0
FamilySize      0
IsAlone         0
HasCabin        0
dtype: int64

In [150]:
x_y_train["Age"].median()

np.float64(28.0)

In [151]:
x_y_train["Age"] = x_y_train["Age"].fillna(x_y_train["Age"].median())
x_y_train.isnull().sum()

Survived        0
Pclass          0
Name            0
Sex             0
Age             0
SibSp           0
Parch           0
Ticket          0
Fare            0
Cabin         687
Embarked        0
FamilySize      0
IsAlone         0
HasCabin        0
dtype: int64

In [152]:
x_y_train.head(2)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize,IsAlone,HasCabin
PassengerId,,,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,0,0
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,0,1

In [153]:
x_y_train = pd.get_dummies(x_y_train, columns=["Sex", "Embarked"])
x_y_train

,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,FamilySize,IsAlone,HasCabin,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,2,0,0,False,True,False,False,True
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,2,0,1,True,False,True,False,False
3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,1,1,0,True,False,False,False,True
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,2,0,1,True,False,False,False,True
5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,1,1,0,False,True,False,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",27.0,0,0,211536,13.0000,NaN,1,1,0,False,True,False,False,True
888,1,1,"Graham, Miss. Margaret Edith",19.0,0,0,112053,30.0000,B42,1,1,1,True,False,False,False,True
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",28.0,1,2,W./C. 6607,23.4500,NaN,4,0,0,True,False,False,False,True
890,1,1,"Behr, Mr. Karl Howell",26.0,0,0,111369,30.0000,C148,1,1,1,False,True,True,False,False
891,0,3,"Dooley, Mr. Patrick",32.0,0,0,370376,7.7500,NaN,1,1,0,False,True,False,True,False

In [154]:
x_y_train= x_y_train.drop(["Name", "Ticket", "Cabin", "SibSp", "Parch"],  axis=1)
x_y_train

,Survived,Pclass,Age,Fare,FamilySize,IsAlone,HasCabin,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,,,
1,0,3,22.0,7.2500,2,0,0,False,True,False,False,True
2,1,1,38.0,71.2833,2,0,1,True,False,True,False,False
3,1,3,26.0,7.9250,1,1,0,True,False,False,False,True
4,1,1,35.0,53.1000,2,0,1,True,False,False,False,True
5,0,3,35.0,8.0500,1,1,0,False,True,False,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,27.0,13.0000,1,1,0,False,True,False,False,True
888,1,1,19.0,30.0000,1,1,1,True,False,False,False,True
889,0,3,28.0,23.4500,4,0,0,True,False,False,False,True
890,1,1,26.0,30.0000,1,1,1,False,True,True,False,False
891,0,3,32.0,7.7500,1,1,0,False,True,False,True,False

In [157]:
x_y_train.keys()

Index(['Survived', 'Pclass', 'Age', 'Fare', 'FamilySize', 'IsAlone',
       'HasCabin', 'Sex_female', 'Sex_male', 'Embarked_C', 'Embarked_Q',
       'Embarked_S'],
      dtype='object')

In [158]:
x_y_train[['Sex_female', 'Sex_male', 'Embarked_C', 'Embarked_Q',
       'Embarked_S']] = x_y_train[['Sex_female', 'Sex_male', 'Embarked_C', 'Embarked_Q',
       'Embarked_S']].astype(int)
x_y_train

,Survived,Pclass,Age,Fare,FamilySize,IsAlone,HasCabin,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,,,,
1,0,3,22.0,7.2500,2,0,0,0,1,0,0,1
2,1,1,38.0,71.2833,2,0,1,1,0,1,0,0
3,1,3,26.0,7.9250,1,1,0,1,0,0,0,1
4,1,1,35.0,53.1000,2,0,1,1,0,0,0,1
5,0,3,35.0,8.0500,1,1,0,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,27.0,13.0000,1,1,0,0,1,0,0,1
888,1,1,19.0,30.0000,1,1,1,1,0,0,0,1
889,0,3,28.0,23.4500,4,0,0,1,0,0,0,1
890,1,1,26.0,30.0000,1,1,1,0,1,1,0,0
891,0,3,32.0,7.7500,1,1,0,0,1,0,1,0